<?php
/**
 * Properties Russian Lexicon Entries for HybridAuth
 *
 * @package hybridauth
 * @subpackage lexicon
 */
$_lang['ha.providers'] = 'Список провайдеров авторизации, через запятую. Все доступные провайдеры находятся тут {core_path}components/hybridauth/model/hybridauth/lib/Providers/. Например, &providers=`Google,Twitter,Facebook`.';
$_lang['ha.groups'] = 'Список групп для регистрации пользователя, через запятую. Можно указывать роль юзера в группе через двоеточие. Например, &groups=`Users:1` добавит юзера в группу "Users" с ролью "member".';
$_lang['ha.rememberme'] = 'Запомниает пользователя на долгое время. По умолчанию - включено.';
$_lang['ha.loginContext'] = 'Основной контекст для авторизации. По умолчанию - текущий.';
$_lang['ha.addContexts'] = 'Дополнительные контексты, через запятую. Например, &addContexts=`web,ru,en`';

$_lang['ha.loginResourceId'] = 'Идентификатор ресурса, на который отправлять юзера после авторизации. По умолчанию, это 0 - обновляет текущую страницу.';
$_lang['ha.logoutResourceId'] = 'Идентификатор ресурса, на который отправлять юзера после завершения сессии. По умолчанию, это 0 - обновляет текущую страницу.';

$_lang['ha.loginTpl'] = 'Этот чанк будет показан анонимному пользователю, то есть любому гостю.';
$_lang['ha.logoutTpl'] = 'Этот чанк будет показан авторизованному пользователю.';
$_lang['ha.profileTpl'] = 'Чанк для вывода и редактирования профиля пользователя.';
$_lang['ha.providerTpl'] = 'Чанк для вывода ссылки на авторизацию или привязку сервиса к учетной записи.';
$_lang['ha.activeProviderTpl'] = 'Чанк для вывода иконки привязанного сервиса.';

$_lang['ha.profileFields'] = 'Список разрешенных для редактирования полей юзера, через запятую. Также можно указать максимальну. длину значений, через двоеточие. Например, &profileFields=`username:25,fullname:50,email`.';
$_lang['ha.requiredFields'] = 'Список обязательных полей при редактировании. Эти поля должны быть заполнены для успешного обновления профиля. Например, &requiredFields=`username,fullname,email`.';
$_lang['ha.redirectUri'] = 'Вы можете указать "redirect_uri", на который вас отправит удалённый сервис. По умолчанию, это корень текущего контекста.';
